
## Plan Result (prod_dns)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * cloudflare_dns_record.main_records[&#34;home&#34;]
  * module.adguard_gamora.adguard_config.config
  * module.adguard_thanos.adguard_config.config


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_dns_record.main_records["home"] will be updated in-place
  ~ resource "cloudflare_dns_record" "main_records" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-02-23T20:17:22Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "622ecaccde0ac598edc65c028e7e13fc"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-02-23T20:17:22Z" -> (known after apply)
      ~ name                = "home.bancey.xyz" -> "home"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.adguard_gamora.adguard_config.config will be updated in-place
  ~ resource "adguard_config" "config" {
      - blocked_services                = [] -> null
      ~ dns                             = {
          - allowed_clients            = [] -> null
          - disallowed_clients         = [] -> null
            # (25 unchanged attributes hidden)
        }
        id                              = "1"
      ~ last_updated                    = "Saturday, 22-Mar-25 10:15:20 UTC" -> (known after apply)
      ~ tls                             = {
          ~ dns_names          = [] -> (known after apply)
          ~ issuer             = null -> (known after apply)
          ~ key_type           = null -> (known after apply)
          ~ not_after          = null -> (known after apply)
          ~ not_before         = null -> (known after apply)
          ~ private_key_saved  = false -> (known after apply)
          ~ subject            = null -> (known after apply)
          ~ valid_cert         = false -> (known after apply)
          ~ valid_chain        = false -> (known after apply)
          ~ valid_key          = false -> (known after apply)
          ~ valid_pair         = false -> (known after apply)
          ~ warning_validation = null -> (known after apply)
            # (9 unchanged attributes hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.adguard_thanos.adguard_config.config will be updated in-place
  ~ resource "adguard_config" "config" {
      - blocked_services                = [] -> null
      ~ dns                             = {
          - allowed_clients            = [] -> null
          - disallowed_clients         = [] -> null
            # (25 unchanged attributes hidden)
        }
        id                              = "1"
      ~ last_updated                    = "Saturday, 22-Mar-25 10:14:53 UTC" -> (known after apply)
      ~ tls                             = {
          ~ dns_names          = [] -> (known after apply)
          ~ issuer             = null -> (known after apply)
          ~ key_type           = null -> (known after apply)
          ~ not_after          = null -> (known after apply)
          ~ not_before         = null -> (known after apply)
          ~ private_key_saved  = false -> (known after apply)
          ~ subject            = null -> (known after apply)
          ~ valid_cert         = false -> (known after apply)
          ~ valid_chain        = false -> (known after apply)
          ~ valid_key          = false -> (known after apply)
          ~ valid_pair         = false -> (known after apply)
          ~ warning_validation = null -> (known after apply)
            # (9 unchanged attributes hidden)
        }
        # (8 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":514,"Program":"tfcmt","SHA1":"","Target":"prod_dns","Vars":{}} -->